Repository: toinou1406/clean_autorisations
Catalog: lib/l10n/app_*.arb
Languages: es, fr, uk, zh

source: Privacy First
es: La privacidad primero
fr: La confidentialité d'abord
uk: Конфіденційність перш за все
zh: 隐私第一

# permissionScreenBody
source: Clean analyzes your photos directly on your device. Nothing is ever uploaded to a server.
es: Clean analiza tus fotos directamente en tu dispositivo. Nada se sube a un servidor.
fr: SimpleClean analyse vos photos directement sur votre appareil. Rien n'est jamais téléchargé sur un serveur.
uk: Clean аналізує ваші фотографії безпосередньо на вашому пристрої. Нічого ніколи не завантажується на сервер.
zh: Clean 直接在您的设备上分析您的照片。任何内容都不会上传到服务器。

source: Grant Access & Continue
es: Conceder acceso y continuar
fr: Autoriser l'accès et continuer
uk: Надати доступ і продовжити
zh: 授予访问权限并继续

# homeScreenTitle
source: Clean
fr: SimpleClean
zh: 主页

# sortingMessageAnalyzing
source: Analyzing photo metadata...
es: Analizando metadatos de fotos...
fr: Analyse des métadonnées des photos...
uk: Аналіз метаданих фото...
zh: 正在分析照片...

# sortingMessageBlurry
source: Detecting blurry images...
es: Detectando imágenes borrosas...
fr: Détection des images floues...
uk: Виявлення розмитих зображень...
zh: 查找模糊的照片...

# sortingMessageScreenshots
source: Searching for bad screenshots...
es: Buscando capturas de pantalla malas...
fr: Recherche de mauvaises captures d'écran...
uk: Пошук поганих знімків екрана...
zh: 识别截图...

# sortingMessageDuplicates
source: Checking for duplicates...
es: Comprobando duplicados...
fr: Vérification des doublons...
uk: Перевірка наявності дублікатів...
zh: 检测重复项...

# sortingMessageScores
source: Calculating photo scores...
es: Calculando puntuaciones de fotos...
fr: Calcul des scores des photos...
uk: Обчислення оцінок фотографій...
zh: 计算分数...

# sortingMessageCompiling
source: Compiling results...
es: Compilando resultados...
fr: Compilation des résultats...
uk: Збір результатів...
zh: 正在编译结果...

# sortingMessageRanking
source: Ranking photos by 'badness'...
es: Clasificando fotos por 'maldad'...
fr: Classement des photos par 'mauvaise qualité'...
uk: Ранжування фотографій за «поганістю»...
zh: 正在对您的照片进行排名...

# sortingMessageFinalizing
source: Finalizing the photo selection...
es: Finalizando la selección de fotos...
fr: Finalisation de la sélection de photos...
uk: Завершення вибору фотографій...
zh: 正在完成...

# noMorePhotos
source: No more deletable photos found!
es: ¡No se encontraron más fotos que se puedan eliminar!
fr: Plus de photos supprimables trouvées !
uk: Більше не знайдено фотографій для видалення!
zh: 没有更多可整理的照片了！

# errorOccurred
source: An error occurred: {error}
es: Ocurrió un error: {error}
fr: Une erreur est survenue : {error}
uk: Сталася помилка: {error}
zh: 发生错误：{error}

# photosDeleted
source: Deleted {count} photos and saved {space}
es: {count} fotos eliminadas y {space} ahorrados
fr: {count} photos supprimées et {space} économisés
uk: Видалено {count} фотографій і збережено {space}
zh: {count} 张照片已删除，节省了 {space}！

# errorDeleting
source: Error deleting photos: {error}
es: Error al eliminar fotos: {error}
fr: Erreur lors de la suppression des photos : {error}
uk: Помилка під час видалення фотографій: {error}
zh: 删除时出错：{error}

source: Re-sort
es: Reordenar
fr: Retrier
uk: Повторне сортування
zh: 重新排序

# delete
source: Delete ({count})
es: Eliminar ({count})
fr: Supprimer ({count})
uk: Видалити ({count})
zh: 删除 {count}

source: Pass
es: Pasar
fr: Passer
uk: Пропустити
zh: 跳过

source: Analyze Photos
es: Analizar fotos
fr: Analyser les photos
uk: Аналізувати фотографії
zh: 分析照片

# fullScreenTitle
source: {count} of {total}
es: {count} de {total}
fr: {count} sur {total}
uk: {count} з {total}
zh: {count} / {total}

source: Kept
es: Guardada
fr: Gardée
uk: Збережено
zh: 已保留

source: Keep
es: Guardar
fr: Garder
uk: Зберегти
zh: 保留

source: Failed to load image
es: Error al cargar la imagen
fr: Échec du chargement de l'image
uk: Не вдалося завантажити зображення
zh: 加载图片失败

# couldNotDelete
source: Could not delete photos. Please try again.
es: No se pudieron eliminar las fotos. Por favor, inténtalo de nuevo.
fr: Impossible de supprimer les photos. Veuillez réessayer.
uk: Не вдалося видалити фотографії. Будь ласка спробуйте ще раз.
zh: 无法删除照片。请稍后再试。

# photoAccessRequired
source: Full photo access permission is required.
es: Se requiere permiso de acceso completo a las fotos.
fr: Une autorisation d'accès complète aux photos est requise.
uk: Потрібен повний дозвіл на доступ до фотографій.
zh: 需要照片访问权限才能继续。

source: Settings
es: Ajustes
fr: Paramètres
uk: Налаштування
zh: 设置

source: Storage Used
es: Almacenamiento usado
fr: Stockage utilisé
uk: Використано сховище
zh: 已用存储空间

source: Space Saved (This Month)
es: Espacio ahorrado (este mes)
fr: Espace économisé (ce mois-ci)
uk: Збережено місця (цього місяця)
zh: 本月节省的空间

# appTitle
source: Clean
fr: SimpleClean

source: Choose your language
es: Elige tu idioma
fr: Choisissez votre langue
uk: Виберіть свою мову
zh: 选择您的语言

# permissionTitle
source: Photo Access Required
es: Acceso a fotos requerido
fr: Accès aux photos requis
uk: Потрібен доступ до фотографій
zh: 需要照片访问权限

# permissionDescription
source: Clean needs full access to your photos to work properly. Please choose 'Allow access to all photos' when prompted.
es: Clean necesita acceso a tus fotos para ayudarte a limpiarlas.
fr: SimpleClean a besoin d'un accès complet à vos photos pour fonctionner correctement. Veuillez choisir 'Autoriser l'accès à toutes les photos' lorsque vous y êtes invité.
uk: Clean потребує доступу до ваших фотографій, щоб допомогти вам їх очистити.
zh: 为了扫描和管理您的照片，此应用程序需要访问您设备存储的权限。

source: Grant Permission
es: Conceder permiso
fr: Autoriser l'accès
uk: Надати дозвіл
zh: 授予权限

source: Permission Required
es: Permiso requerido
fr: Autorisation requise
uk: Потрібен дозвіл
zh: 需要权限

# permissionPermanentlyDenied
source: Photo access has been permanently denied. To continue, you must enable it in your device settings.
es: El acceso a las fotos ha sido denegado permanentemente. Para continuar, debe habilitarlo en la configuración de su dispositivo.
fr: L'accès aux photos a été refusé de manière permanente. Pour continuer, vous devez l'activer dans les paramètres de votre appareil.
uk: Доступ до фотографій було назавжди заборонено. Щоб продовжити, ви повинні ввімкнути його в налаштуваннях свого пристрою.
zh: 照片访问权限已被永久拒绝。要继续，您必须在设备设置中启用它。

# permissionWarning
source: You must select 'Allow Access to All Photos' to use the app.
es: No se concedió acceso a las fotos. Por favor, concede acceso total a las fotos para continuar. Si denegaste el permiso anteriormente, es posible que debas habilitarlo en la configuración de tu dispositivo.
fr: Vous devez sélectionner 'Autoriser l'accès à toutes les photos' pour utiliser l'application.
uk: Для пошуку та видалення небажаних фотографій потрібен повний доступ до фотографій. Будь ласка, надайте доступ у налаштуваннях телефону.
zh: 照片访问未被授予。请授予完整的照片访问权限以继续。如果您之前拒绝了权限，您可能需要在您的设备设置中启用它。

source: Cancel
es: Cancelar
fr: Annuler
uk: Скасувати
zh: 取消

source: Open Settings
es: Abrir la configuración
fr: Ouvrir les paramètres
uk: Відкрити налаштування
zh: 打开设置

source: Total Space Saved
es: Espacio total ahorrado
fr: Espace total économisé
uk: Загалом заощаджено місця
zh: 总共节省的空间

source: Ready to Clean?
es: ¿Listo para limpiar?
fr: Prêt à nettoyer ?
uk: Готові до очищення?
zh: 准备好清理了吗？

# letsFindPhotos
source: Let's find some photos you can safely delete.
es: Busquemos algunas fotos que puedas eliminar de forma segura.
fr: Trouvons des photos que vous pouvez supprimer en toute sécurité.
uk: Давайте знайдемо фотографії, які можна безпечно видалити.
zh: 让我们查找一些可以安全删除的照片。

# storageSpaceSaved
source: Saved
es: Ahorrado
fr: Économisé
uk: Зекономлено
zh: 已节省

# gridTutorialText
source: Tap to see a photo fullscreen. Long-press or double-tap to keep it.
es: Toca para ver en pantalla completa. Mantén presionado o toca dos veces para conservar.
fr: Appuyez pour voir en grand. Appuyez longuement ou double-cliquez pour conserver.
uk: Торкніться, щоб переглянути на весь екран. Натисніть і утримуйте або двічі торкніться, щоб зберегти.
zh: 点击可全屏查看照片。长按或双击可保留照片。

# gridTutorialDismiss
source: Tap anywhere to continue
es: Toca en cualquier lugar para continuar
fr: Appuyez n'importe où pour continuer
uk: Торкніться будь-де, щоб продовжити
zh: 在任何地方点一下即可继续
